ninxmeow/Holy80/lib/chibios-contrib/os/common/ext/CMSIS/AT32/AT32F402_5xx/at32f402_5xx.h
} GPIO_TypeDef;

/**
  * @brief type define system config register all
  */
typedef struct
{
  /**
    * @brief scfg cfg1 register, offset:0x00
    */
  __IO uint32_t CFG1;


  /**
    * @brief scfg cfg2 register, offset:0x04
    */
  __IO uint32_t CFG2;


  /**
    * @brief scfg exintc register, offset:0x08-0x14
    */
  __IO uint32_t EXINTC[4];

  /**
    * @brief scfg reserved1 register, offset:0x18~0x28
    */
  __IO uint32_t RESERVED1[5];

  /**
    * @brief scfg uhdrv register, offset:0x2C
    */
  __IO uint32_t UHDRV;

} SCFG_TypeDef;

/**
  * @brief type define tmr register all
  */
typedef struct
{
  /**
    * @brief tmr ctrl1 register, offset:0x00
    */
  __IO uint32_t CTRL1;

  /**
    * @brief tmr ctrl2 register, offset:0x04
    */
  __IO uint32_t CTRL2;

  /**
    * @brief tmr smc register, offset:0x08
    */
  __IO uint32_t STCTRL;

  /**
    * @brief tmr die register, offset:0x0C
    */
  __IO uint32_t IDEN;

  /**
    * @brief tmr ists register, offset:0x10
    */
  __IO uint32_t ISTS;

  /**
    * @brief tmr eveg register, offset:0x14
    */
  __IO uint32_t SWEVT;

  /**
    * @brief tmr ccm1 register, offset:0x18
    */
  __IO uint32_t CM1;

  /**
    * @brief tmr ccm2 register, offset:0x1C
    */
  __IO uint32_t CM2;

  /**
    * @brief tmr cce register, offset:0x20
    */
  __IO  uint32_t CCTRL;

  /**
    * @brief tmr cnt register, offset:0x24
    */
  __IO uint32_t CVAL;

  /**
    * @brief tmr div, offset:0x28
    */
  __IO uint32_t DIV;

  /**
    * @brief tmr pr register, offset:0x2C
    */
  __IO  uint32_t PR;

  /**
    * @brief tmr rpr register, offset:0x30
    */
  __IO uint32_t RPR;

  /**
    * @brief tmr c1dt register, offset:0x34
    */
  __IO uint32_t C1DT;

  /**
    * @brief tmr c2dt register, offset:0x38
    */
  __IO uint32_t C2DT;

  /**
    * @brief tmr c3dt register, offset:0x3C
    */
  __IO uint32_t C3DT;

  /**
    * @brief tmr c4dt register, offset:0x40
    */
  __IO uint32_t C4DT;

  /**
    * @brief tmr brk register, offset:0x44
    */
  __IO uint32_t BRK;

  /**
    * @brief tmr dmactrl register, offset:0x48
    */
  __IO uint32_t DMACTRL;

  /**
    * @brief tmr dmadt register, offset:0x4C
    */
  __IO uint32_t DMADT;

  /**
    * @brief tmr rmp register, offset:0x50
    */
  __IO uint32_t RMP;

  /**
    * @brief tmr reserved1 register, offset:0x54-0x6C
    */
  __IO uint32_t RESERVED1[7];

  /**
    * @brief tmr cm3 register, offset:0x70
    */
  __IO uint32_t CM3;

  /**
    * @brief tmr c5dt register, offset:0x74
    */
  __IO uint32_t C5DT;

} TMR_TypeDef;

/**
  * @brief type define debug register all
  */
typedef struct
{
  /**
    * @brief debug idcode register, offset:0x00
    */
  __IO uint32_t IDCODE;

  /**
    * @brief debug ctrl register, offset:0x04
    */
  __IO uint32_t CTRL;

  /**
    * @brief debug apb1 frz register, offset:0x08
    */
  __IO uint32_t APB1_PAUSE;

  /**
    * @brief debug apb2 frz register, offset:0x0c
    */
  __IO uint32_t APB2_PAUSE;

} DEBUG_TypeDef;

/**
  * @brief type define dma register
  */
typedef struct
{
  /**
    * @brief dma sts register, offset:0x00
    */
  __IO uint32_t STS;

  /**
    * @brief dma clr register, offset:0x04
    */
  __IO uint32_t CLR;

  /**
    * @brief reserved, offset:0x08~0xFC
    */
  __IO uint32_t RESERVED1[62];

  /**
    * @brief dmamux sel register, offset:0x100
    */
  __IO uint32_t MUXSEL;

  /**
    * @brief reserved, offset:0x08~0xFC
    */
  __IO uint32_t RESERVED2[11];

  /**
    * @brief dmamux syncsts register, offset:0x130
    */
  __IO uint32_t MUXSYNCSTS;

  /**
    * @brief dmamux syncclr register, offset:0x134
    */
  __IO uint32_t MUXSYNCCLR;

  /**
    * @brief dmamux request generator status register, offset:0x138
    */
  __IO uint32_t MUXGSTS;

  /**
    * @brief dmamux request generator status clear register, offset:0x13C
    */
  __IO uint32_t MUXGCLR;

} DMA_TypeDef;

/**
  * @brief type define dma channel register all
  */
typedef struct
{
  /**
    * @brief dma ctrl register, offset:0x08+20*(x-1) x=1...7
    */
  __IO uint32_t CTRL;

  /**
    * @brief dma dtcnt register, offset:0x0C+20*(x-1) x=1...7
    */
  __IO uint32_t DTCNT;

  /**
    * @brief dma cpba register, offset:0x10+20*(x-1) x=1...7
    */
  __IO uint32_t PADDR;

  /**
    * @brief dma cmba register, offset:0x14+20*(x-1) x=1...7
    */
  __IO uint32_t MADDR;
} DMA_Channel_TypeDef;

/**
  * @brief type define dmamux muxsctrl register
  */
typedef struct
{
  /**
    * @brief dma muxsctrl register
    */
  __IO uint32_t MUXCTRL;

} DMAMUX_Channel_TypeDef;

/**
  * @brief type define dmamux request generator register all
  */
typedef struct
{
  /**
    * @brief dmamux request generator register, offset:0x120+4*(x-1) x=1...4
    */
  __IO uint32_t GCTRL;

} DMAMUX_Generator_TypeDef;

/**
  * @brief type define adc register all
  */
typedef struct
{
  /**
    * @brief adc sts register, offset:0x00
    */
  __IO uint32_t STS;

  /**
    * @brief adc ctrl1 register, offset:0x04
    */  
   __IO uint32_t CTRL1;

  /**
    * @brief adc ctrl2 register, offset:0x08
    */
  __IO uint32_t CTRL2;

  /**
    * @brief adc spt1 register, offset:0x0C
    */
  __IO uint32_t SPT1;

  /**
    * @brief adc spt2 register, offset:0x10
    */
  __IO uint32_t SPT2;

  /**
    * @brief adc pcdto1 register, offset:0x14
    */
  __IO uint32_t PCDTO1;

  /**
    * @brief adc pcdto2 register, offset:0x18
    */
  __IO uint32_t PCDTO2;

  /**
    * @brief adc pcdto3 register, offset:0x1C
    */
  __IO uint32_t PCDTO3;

  /**
    * @brief adc pcdto4 register, offset:0x20
    */
  __IO uint32_t PCDTO4;

  /**
    * @brief adc vmhb register, offset:0x24
    */
  __IO uint32_t VMHB;

  /**
    * @brief adc vmlb register, offset:0x28
    */
  __IO uint32_t VMLB;

  /**
    * @brief adc osq1 register, offset:0x2C
    */
  __IO uint32_t OSQ1;

  /**
    * @brief adc osq2 register, offset:0x30
    */
  __IO uint32_t OSQ2;

  /**
    * @brief adc osq3 register, offset:0x34
    */
  __IO uint32_t OSQ3;

  /**
    * @brief adc psq register, offset:0x38
    */
  __IO uint32_t PSQ;

  /**
    * @brief adc pdt1 register, offset:0x3C
    */
  __IO uint32_t PDT1;

  /**
    * @brief adc pdt2 register, offset:0x40
    */
  __IO uint32_t PDT2;

  /**
    * @brief adc pdt3 register, offset:0x44
    */
  __IO uint32_t PDT3;

  /**
    * @brief adc pdt4 register, offset:0x48
    */
  __IO uint32_t PDT4;

  /**
    * @brief adc odt register, offset:0x4C
    */
  __IO uint32_t ODT;

  /**
    * @brief adc reserved1 register, offset:0x50~0x7C
    */
  __IO uint32_t RESERVED1[12];

  /**
    * @brief adc oversample register, offset:0x80 
    */
  __IO uint32_t OVSP;

} ADC_TypeDef;

/**
  * @brief type define adc register all
  */
typedef struct
{
  /**
    * @brief adc reserved1 register, offset:0x00
    */
  __IO uint32_t RESERVED1;
  
  /**
    * @brief adc cctrl register, offset:0x04
    */
  __IO uint32_t CCTRL;

} ADCCOM_TypeDef;

/**
  * @brief type define i2c register all
  */
typedef struct
{
  /**
    * @brief i2c ctrl1 register, offset:0x00
    */
  __IO uint32_t CTRL1;

  /**
    * @brief i2c ctrl2 register, offset:0x04
    */
  __IO uint32_t CTRL2;

  /**
    * @brief i2c oaddr1 register, offset:0x08
    */
  __IO uint32_t OADDR1;

  /**
    * @brief i2c oaddr2 register, offset:0x0C
    */
  __IO uint32_t OADDR2;

  /**
    * @brief i2c clkctrl register, offset:0x10
    */
  __IO uint32_t CLKCTRL;

  /**
    * @brief i2c timeout register, offset:0x14
    */
  __IO uint32_t TIMEOUT;

  /**
    * @brief i2c sts register, offset:0x18
    */
  __IO uint32_t STS;

  /**
    * @brief i2c clr register, offset:0x1C
    */
  __IO uint32_t CLR;

  /**
    * @brief i2c pec register, offset:0x20
    */
  __IO uint32_t PEC;

  /**
    * @brief i2c rxdt register, offset:0x20
    */
  __IO uint32_t RXDT;

  /**
    * @brief i2c txdt register, offset:0x20
    */
  __IO uint32_t TXDT;

